const poems = [
    {
        year: "1910年",
        title: "七绝·诗改赠父亲",
        content: "孩儿立志出乡关，学不成名誓不还。 埋骨何须桑梓地，人生无处不青山。",
        analysis: "这首诗是少年毛泽东走出乡关、奔向外面世界的宣言书，从中表明了他胸怀天下、志在四方的远大抱负。",
        audio: './scr/audio/七绝·改诗赠父亲.mp3',
        bg: "1910年秋天，毛泽东离开家乡韶山，走向外面更广阔的世界。这是他人生历程中的第一个转折。怀着激动心情，临行前他写下这首诗，夹在父亲每天必看的帐簿里，以作告别。"
    },
{
        year: "1919年",
        title: "四言诗·祭母文",
        content: "呜呼吾母，遽然而死。寿五十三，生有七子。七子余三，即东民覃。其他不育，二女二男。育吾兄弟，艰辛备历。摧折作磨，因此遘疾。中间万万，皆伤心史。不忍卒书，待徐温吐。今则欲言，只有两端：一则盛德，一则恨偏。吾母高风，首推博爱。远近亲疏，一皆覆载。恺恻慈祥，感动庶汇。爱力所及，原本真诚。不作诳言，不存欺心。整饬成性，一丝不诡。手泽所经，皆有条理。头脑精密，擘理分情。事无遗算，物无遁形。洁净之风，传遍戚里。不染一尘，身心表里。五德荦荦，乃其大端。合其人格，如在上焉。恨偏所在，三纲之末。有志未伸，有求不获。精神痛苦，以此为卓。天乎人欤，倾地一角。次则儿辈，育之成行。如果未熟，介在青黄。病时揽手，酸心结肠。但呼儿辈，各务为良。又次所怀，好亲至爱。或属素恩，或多劳瘁。大小亲疏，均待报赍。总兹所述，盛德所辉。必秉悃忱，则效不违。致于所恨，必补遗缺。念兹在兹，此心不越。养育深恩，春辉朝霭。报之何时，精禽大海。呜呼吾母，母终未死。躯壳虽隳，灵则万古。有生一日，皆报恩时。有生一日，皆伴亲时。今也言长，时则苦短。惟挈大端，置其粗浅。此时家奠，尽此一觞。后有言陈，与日俱长。",
        analysis: "《四言诗·祭母文》是毛泽东为纪念其母亲而创作的。这首诗以其真挚的情感和朴实的语言，表达了作者对母亲的深深怀念和对其一生的赞颂。诗中，毛泽东描述了母亲的生活琐事，以及她对子女的辛勤付出和无私奉献。同时，他也表达了对母亲高尚品质的赞扬，包括她的博爱、慈祥和诚实等。最后，他表达了对母亲的深深感激和无尽的思念。 这首诗的语言简练而富有力量，情感真挚而感人。通过对母亲的描绘，我们可以看到一个勤劳、善良、无私的母亲形象，同时也看到了毛泽东对母亲的深深敬仰和感激之情。整首诗充满了对母亲的怀念和对生命的思考，是一篇具有深刻人文内涵的作品。",
        audio: './scr/audio/四言诗·祭母文.mp3',
        bg: "《四言诗·祭母文》是毛泽东创作的一首四言诗。这篇《祭母文》以恳挚朴实的语言，饱含深情地追述了母亲一生的辛劳和美德，表达了一个儿子爱母、念母、思母、报母的一腔挚情，具有撼人心魄之艺术感染力。"
    },

{
        year: "1921年",
        title: "虞美人·枕上",
        content: "堆来枕上愁何状，江海翻波浪。夜长天色总难明，寂寞披衣起坐数寒星。晓来百念皆灰烬，剩有离人影。一勾残月向西流，对此不抛眼泪也无由。",
        analysis: "《虞美人·枕上》是毛泽东在1921年创作的一首词，表达了作者对妻子的深深思念和离别之痛。 词的上阕，作者用“堆来枕上愁何状，江海翻波浪”形象地描绘了自己心中的愁苦，就像江海里的巨波大浪一样汹涌澎湃，无法抑制。接着，“夜长天色总难明，寂寞披衣起坐数寒星”则进一步描绘了作者因思念而失眠，只能在夜晚数着星星等待黎明的到来。 下阕，“晓来百念都灰烬，剩有离人影”表达了作者在天亮时，所有的思绪都已经化为了灰烬，只剩下对离别之人的思念。最后，“一钩残月向西流，对此不抛眼泪也无由”则描绘了作者在残月下沉思，无法抑制自己的悲伤。 整首词语言简练而富有力量，情感真挚而动人。通过对愁苦、失眠、思念等情感的细腻描绘，展现了作者深深的离别之痛和对亲人的思念之情。",
        audio: './scr/audio/虞美人·枕上.mp3',
        bg: "1920年冬毛泽东与杨开慧结婚，第二年春夏间毛泽东外出考察。旅途中，毛泽东深深思念妻子。一天晚上，万种情思如波涛翻滚、涌上心头，整晚辗转难眠，好不容易熬到天明，却感到百念可遣，只有离别的妻子在眼前。遥望挂在天边的一弯残月，不由落下相思的泪水。此时的毛泽东情意缠绵，不能自已，于是随手写下了这首《虞美人·枕上》。"
    },
    {
        year: "1925年",
        title: "沁园春·长沙",
        content: "独立寒秋，湘江北去，橘子洲头。看万山红遍，层林尽染；漫江碧透，百舸争流。鹰击长空，鱼翔浅底，万类霜天竞自由。怅寥廓，问苍茫大地，谁主沉浮？ 携来百侣曾游，忆往昔峥嵘岁月稠。恰同学少年，风华正茂；书生意气，挥斥方遒。指点江山，激扬文字，粪土当年万户侯。曾记否，到中流击水，浪遏飞舟？",
        analysis: "该词通过对长沙秋景的描绘和对青年时代革命斗争生活的回忆，抒写出革命青年对国家命运的感慨和以天下为己任，蔑视反动统治者，改造旧中国的豪情壮志。全词在片语之间，融情入理，情景交融。",
        audio: './scr/audio/沁园春长沙.mp3',
        bg: "《沁园春·长沙》是毛泽东1925年晚秋所作。当时毛泽东离开故乡韶山，去广州主持农民运动讲习，途经长沙，重游了橘子洲。作者面对湘江上美丽动人的自然秋景，联想起当时的革命形势，写下了这首词。"
    },
 {
        year: "1927年",
        title: "菩萨蛮·黄鹤楼",
        content: "茫茫九派流中国，沉沉一线穿南北。烟雨莽苍苍，龟蛇锁大江。黄鹤知何去？剩有游人处。把酒酹滔滔，心潮逐浪高！",
        analysis: "这首词以其豪迈的气势和深刻的情感表达，展现了毛泽东主席对于国家命运和个人情感的深刻思考。词的上半部分，毛泽东主席以黄鹤楼为背景，描绘了长江的宏伟和武汉三镇的雄姿，以及龟山和蛇山的壮观景色。下半部分则表达了毛泽东主席对于黄鹤楼的神秘传说和历史的感慨，以及对未来的期待和决心。整首词语言生动，意境深远，充满了强烈的爱国主义情怀和革命精神。",
        audio: './scr/audio/菩萨蛮·黄鹤楼.mp3',
        bg: "《菩萨蛮·黄鹤楼》是毛泽东的词作，作于1927年。此词表达了作者对于其所处的时代的沉郁抱负和热切期待，也写出了对革命前途的焦虑，对未来充满信心，和对革命抱有坚定信念的乐观。"
    },
{
        year: "1929年",
        title: "清平乐·蒋桂战争",
        content: "风云突变，军阀重开战。洒向人间都是怨，一枕黄梁再现。红旗跃过汀江，直下龙岩上杭。收拾金瓯一片，分田分地真忙。",
        analysis: "风起云涌，局势变化莫测，军阀再次开战。他们洒向民众的尽是无边的怨恨，他们的黄粱美梦仅是昙花一现。红军越过汀江，直逼龙岩与上杭。收取了祖国山河之一角作为根据地，农民欢欣鼓舞分田分地忙。",
        audio: './scr/audio/清平乐·蒋桂战争.mp3',
        bg: "毛泽东的《清平乐·蒋桂战争》是1929年中国政局全景式的大写真，也是红军创造闽西革命根据地的壮丽画卷，生动形象地说明了“中国红色政权为什么能够存在”的真理，是对“红旗能够打多久”最生动最有力的回答，是对那些对革命还有悲观思想的人最有说服力的深刻教育。"
    },
 {
        year: "1930年",
        title: "蝶恋花·从汀州向长沙",
        content: "六月天兵征腐恶，万丈长缨要把鲲鹏缚。赣水那边红一角，偏师借重黄公略。百万工农齐踊跃，席卷江西直捣湘和鄂。国际悲歌歌一曲，狂飙为我从天落。",
        analysis: "《蝶恋花·从汀州向长沙》是毛泽东的一首词，创作于1930年。这首词描绘了红军从汀州出发，一路征战，最终到达长沙的历史事件。词中运用了丰富的意象和生动的语言，表达了作者对于革命斗争的热烈情感和对胜利的坚定信念。 词的上阕，“六月天兵征腐恶，万丈长缨要把鲲鹏缚”，以虚实相生、正反对比等艺术手法，展现了红军英勇无畏的形象，以及他们对于打败敌人的决心和勇气。下阕则描述了工农群众的积极参与，以及他们在革命中的重要作用，“百万工农齐踊跃，席卷江西直捣湘和鄂”，表现了工农群众的力量和他们的革命热情。 整首词的语言生动有力，情感饱满，充分体现了毛泽东对于革命斗争的热情和对于胜利的坚定信念。同时，词中也表达了对工农群众的深深敬意和赞扬，展现了他们的力量和智慧。 总的来说，《蝶恋花·从汀州向长沙》是一首充满激情和力量的词，它不仅是对历史的记录，也是对未来的展望，充满了对革命胜利的期待和信心。",
        audio: './scr/audio/蝶恋花·从汀州向长沙.mp3',
        bg: "《蝶恋花·从汀州向长沙》是毛泽东的一首词，作于1930年7月攻城战中红军损失惨重，9月13日毛泽东下令撤围退军之时，写出了广大工农群众革命的热情和昂扬的斗志。"
    },
 {
        year: "1933年",
        title: "菩萨蛮·大柏地",
        content: "赤橙黄绿青蓝紫，谁持彩练当空舞？雨后复斜阳，关山阵阵苍。当年鏖战急，弹洞前村壁。装点此关山，今朝更好看。",
        analysis: "《菩萨蛮·大柏地》是毛泽东在1933年夏创作的一首词，描绘了大柏地在雨后的壮丽景色，同时回顾了革命战争的历史。词的上阕，毛泽东以七种颜色描绘出雨后彩虹的绚丽景象，形象生动，富有诗意。下阕则通过回忆过去的战争场景，表现出革命战争的重大意义和革命先烈们的英勇事迹。整首词以欢快的笔调，通过对大自然景色和革命历史的描绘，表现出革命先烈们的英勇事迹和革命胜利后祖国的美好未来。",
        audio: './scr/audio/沁园春长沙.mp3',
        bg: "《沁园春·长沙》是毛泽东1925年晚秋所作。当时毛泽东离开故乡韶山，去广州主持农民运动讲习，途经长沙，重游了橘子洲。作者面对湘江上美丽动人的自然秋景，联想起当时的革命形势，写下了这首词。"
    },
{
        year: "1937年",
        title: "四言诗·祭黄帝陵",
        content: "赫赫始祖，吾华肇造；胄衍祀绵，岳峨河浩。  聪明睿智，光被遐荒；建此伟业，雄立东方。  世变沧桑，中更蹉跌；越数千年，强邻蔑德。  琉台不守，三韩为墟；辽海燕冀，汉奸何多。  以地事敌，敌欲岂足；人执笞绳，我为奴辱。  懿维我祖，命世之英；涿鹿奋战，区宇以宁。  岂其苗裔，不武如斯；泱泱大国，让其沦胥。  东等不才，剑屦俱奋；万里崎岖，为国效命。  频年苦斗，备历险夷；匈奴未灭，何以家为。  各党各界，团结坚固；不论军民，不分贫富。  民族阵线，救国良方；四万万众，坚决抵抗。  民主共和，改革内政；亿兆一心，战则必胜。  还我河山，卫我国权；此物此志，永矢勿谖。  经武整军，昭告列祖；实鉴临之，皇天后土。",
        analysis: "《四言诗·祭黄帝陵》是毛泽东在1937年创作的，这首诗一方面概述了中华民族的始祖黄帝创建大中华的丰功伟绩，另一方面谴责了清政府近百年来丧权辱国的可耻行径，同时表达了中国共产党人和中国人民反对日本侵略、收复国土、保卫国家主权的坚定决心。 诗的开篇“赫赫始祖，吾华肇造”，直接点明了黄帝对于中华民族的重要地位，以及他对中华民族的深远影响。接着，“胄衍祀绵，岳峨河浩”，描绘了中华民族子孙繁衍生息，山川壮丽的景象。 然后，“聪明睿智，光被遐荒”，赞美了黄帝的智慧和贡献，他的智慧照耀了整个华夏大地。“建此伟业，雄立东方”，则是对黄帝建立中华民族这一伟大事业的肯定和赞扬。 再接下来，“世变沧桑，中更蹉跌”，描述了世界的变化和中华民族的挫折。“越数千年，强邻蔑德”，揭示了近代以来，中华民族遭受的屈辱和挑战。 最后，“懿维我祖，命世之英”，表达了对黄帝这位伟大祖先的崇敬和怀念。“涿鹿奋战，区宇以宁”，则是对黄帝在涿鹿之战中取得的胜利的赞扬。“岂其苗裔，不武如斯”，是对后人的期许和鼓励，希望他们能够像黄帝一样英勇无畏，为了中华民族的尊严和利益而奋斗。 总的来说，这首诗充满了对黄帝的崇敬，对中华民族的自豪，以及对未来的期待和信心。它不仅是一首纪念黄帝的诗歌，也是一首激励人们为了中华民族的繁荣而努力的诗歌。",
        audio: './scr/audio/四言诗·祭黄帝陵.mp3',
        bg: "一方面概述了中华民族的始祖黄帝创建大中华的丰功伟绩，一方面谴责了清政府近百年来丧权辱国的可耻行径，同时表达了中国共产党人和中国人民反对日本侵略、收复国土、保卫国家主权的坚定决心，语言朴直，内涵丰厚，爱国报国卫国之情，充溢其间，浩荡正气，令人感奋。"
    },
    {
        year: "1935年",
        title: "七律·长征",
        content: "红军不怕远征难，万水千山只等闲。 五岭逶迤腾细浪，乌蒙磅礴走泥丸。 金沙水拍云崖暖，大渡桥横铁索寒。 更喜岷山千里雪，三军过后尽开颜。",
        analysis: "这是一首记叙二万五千里长征这一震惊全球的历史事件的革命史诗。它不仅以精炼之笔高度地概括了红军夺关杀敌的战斗历程，而且用革命的激情艺术地、形象地表现了红军战士不屈不挠、英勇顽强的大无畏气概和革命乐观主义精神。",
        audio: './scr/audio/七律长征.mp3',
        bg: "《七律·长征》写于1935年9月下旬，10月定稿。这首七律是作于红军战士越过岷山后，长征即将胜利结束前不久的途中。作为红军的领导人，毛泽东在经受了无数次考验后，如今，曙光在前，胜利在望，他心潮澎湃，满怀豪情地写下了这首壮丽的诗篇。"
    },
{
        year: "1945年",
        title: "七律·忆重庆谈判",
        content: "有田有地皆吾主，无法无天是为民。重庆有官皆墨吏，延安无土不黄金。炸桥挖路为团结，夺地争城是斗争。遍地哀鸿满城血，无非一念救苍生。",
        analysis: "《七律·忆重庆谈判》是毛泽东在1946年创作的七律诗。这首诗回顾了1945年在重庆进行的国共谈判，表达了对于国民党政府的批评和对共产党的坚定立场。诗中提到“有田有地皆吾主，无法无天是为民”，意味着全中国的人民都是共产党的主人，共产党不会屈服于国民党政府的压力；“重庆有官皆墨吏，延安无土不黄金”，则揭示了国民党政府的腐败和共产党的廉洁；“炸桥挖路为团结，夺地争城是斗争”，反映了共产党为了人民的利益，不惜付出一切代价；“遍地哀鸿满城血，无非一念救苍生”，则是对国民党政府的无情镇压和无辜人民的苦难表示同情，同时也表达了对共产党的坚定信念和决心。 这首诗的语言明朗通达，看似平淡无奇，但每一句都有相互针对的双层意思，内容很丰富。通过对比手法，诗人表意鲜明，既批判了国民党政府的腐败，也展现了共产党的坚定立场和为人民服务的决心。",
        audio: './scr/audio/七律·忆重庆谈判.mp3',
        bg: "1945年抗战胜利后，国共在重庆谈判期间，蒋介石军队刚到重庆就实行“五子登科”失了民心，蒋介石想来收了延安，所以诗中有“延安无土不黄金”之说，后几句就是说如果实在不得已，就会发动战争来拯救苍生。"
    },
  {
        year: "1949年",
        title: "七律·人民解放军占领南京",
        content: "钟山风雨起苍黄，百万雄师过大江。 虎踞龙盘今胜昔，天翻地覆慨而慷。 宜将剩勇追穷寇，不可沽名学霸王。 天若有情天亦老，人间正道是沧桑。",
        analysis: "本诗风格豪放，笔意雄奇，在艺术上值得称道的有两点：一是叙事与议论、诗情与哲理的完美结合，是政治家、思想家、军事家与诗人的多方智慧相结合的艺术结晶；二是典故运用生动贴切、深刻到位，使历史典故和现实斗争结合得恰到好处。全诗运用了七个典故，这首诗也是毛泽东诗词中运用典故最为绵密的诗作之一。",
        audio: './scr/audio/七律人民解放军占领南京.mp3',
        bg:"1949年4月21日，毛泽东主席和朱德总司令发出《向全国进军的命令》，号令全军坚决、彻底、干净、全部地歼灭中国境内一切敢于抵抗的国民党反动派，解放全中国。中国人民解放军百万大军于4月23日占领国民党反动政府的“首都”南京。毛泽东同志在北平香山双清别墅得到占领南京的捷报，心情振奋，写下了这首诗。"
    },
{
        year: "1950年",
        title: "浣溪沙·和柳亚子先生",
        content: "长夜难明赤县天，百年魔怪舞翩跹，人民五亿不团圆。一唱雄鸡天下白，万方乐奏有于阗，诗人兴会更无前。",
        analysis: "这句诗以“魔怪”比喻反动势力，揭示了亿万人民长期受苦受难的悲惨境地，表达了作者对旧社会的深刻批判和对人民的深切同情。",
        audio: './scr/audio/浣溪沙·和柳亚子先生.mp3',
        bg: "毛泽东收到了柳亚子的词作《浣溪沙》，深为柳亚子的爱国主义精神所感动；又接到了抗美援朝取得第一次战役胜利的捷报，喜不自禁，挥毫写下了这首《浣溪沙·和柳亚子先生》。"
    },
    {
        year: "1954年",
        title: "浪淘沙·北戴河",
        content: "大雨落幽燕，白浪滔天，秦皇岛外打鱼船。一片汪洋都不见，知向谁边？ 往事越千年，魏武挥鞭，东临碣石有遗篇。萧瑟秋风今又是，换了人间。",
        analysis: "这首词的机杼在结尾。“换了人间”，是议论，是感慨，也是描写，极大地表现了诗人与时代的胜概豪情，而且意味深长，余韵悠远，将读者引向一个无限性的时空，去寻味那无穷的言外之意。",
        audio: './scr/audio/浪淘沙北戴河.mp3',
        bg: "新中国成立以后，提前完成第一个五年计划，国家实力增强，农村的合作化运动已有较大的进展，对工商业的改造也开始着手，建设一个工业化的强国的伟大目标也开始提出。1954年夏毛泽东到北戴河住过一些日子，在此填了这首词。"
    },
{
        year: "1955年",
        title: "七绝·莫干山",
        content: "翻身跃入七人房，回首峰峦入莽苍。四十八盘才走过，风驰又已到钱塘。",
        analysis: "《七绝·莫干山》是毛泽东于1955年所作的一首诗。这首诗描绘了他乘车在下山的路中穿行的情景，回头看抛在身后的峰峦已入莽苍，诗人还沉浸在对莫干山盘旋陡峭的山势的回味之中时，回程的路不知不觉地走完了。 诗的前两句“翻身复进七人房，回首峰峦入莽苍”，描述了诗人乘车在下山的路中穿行，回头看抛在身后的峰峦已入莽苍。这里的“翻身复进”即转身跃入，表现了乘车人动作敏捷，状写了上车的动作快而有力，说明心情欢愉，游兴未尽，不但体力未减，而且有所增强。诗人将可坐七人的轿车称为“七人房”，通俗而幽默。 诗的后两句“四十八盘才走过，风驰又已到钱塘”，写出了诗人还沉浸在对莫干山盘旋陡峭的山势的回味之中时，回程的路不知不觉地走完了。这里的“四十八盘”泛指莫干山山间曲折盘旋的山间公路，“风驰”则形象地表现了时光的高速，压缩了出发点与目的地之间巨大的空间距离。 整首诗风格轻快，全诗即景抒情，诗句轻快，语言明白如话，诗趣意兴盎然。诗人此次游兴极好，心境闲适，以致慨叹时光走得太快了。",
        audio: './scr/audio/七绝·莫干山.mp3',
        bg: "七绝·莫干山》是毛泽东创作的一首诗。该诗叙写诗人游玩莫干山后，乘车在下山的路中穿行，回头看抛在身后的峰峦已入莽苍，诗人还沉浸在对莫干山盘旋陡峭的山势的回味之中时，回程的路不知不觉地走完了。该诗风格轻快，全诗即景抒情，诗句轻快，语言明白如话，诗趣意兴盎然。"
    },
{
        year: "1957年",
        title: "蝶恋花·答李淑一",
        content: "我失骄杨君失柳，杨柳轻飏直上重霄九。问讯吴刚何所有，吴刚捧出桂花酒。寂寞嫦娥舒广袖，万里长空且为忠魂舞。忽报人间曾伏虎，泪飞顿作倾盆雨。",
        analysis: "《蝶恋花·答李淑一》是毛泽东为悼念亡妻杨开慧而作的一首词。词中描绘了杨开慧和柳直荀两位烈士的英魂在天堂中欢庆的场景，以及他们对人间革命胜利的热烈期盼。整首词情感真挚，意境深远，充满了对烈士的深深怀念和对革命事业的坚定信念。特别是“杨柳轻飏直上重霄九”一句，更是表达了烈士们的英勇无畏和崇高精神。",
        audio: './scr/audio/蝶恋花·答李淑一.mp3',
        bg: "1957年，毛泽东收到了李淑一的信件，信中附有一首纪念其丈夫柳直荀烈士的词作。毛泽东在收到信件后心生感慨，于是写下了《蝶恋花·答李淑一》这首词，以此寄托对已故妻子杨开慧和烈士柳直荀的哀思。"
    },
    {
        year: "1961年",
        title: "卜算子·咏梅",
        content: "风雨送春归，飞雪迎春到。已是悬崖百丈冰，犹有花枝俏。 俏也不争春，只把春来报。待到山花烂漫时，她在丛中笑。",
        analysis: "此词塑造了梅花俊美而坚韧不拔的形象，鼓励人们要有威武不屈的精神和革命到底的乐观主义精神。上阕主要写梅花傲寒开放的美好身姿，描绘梅花的美丽、积极与坚贞；下阕主要写梅花的精神风貌，表现了梅花坚强不屈、不畏寒冷，对春天充满信心和谦虚的风格。",
        audio: './scr/audio/卜算子咏梅.mp3',
        bg: "1960年6月，在罗马尼亚首都布加勒斯特召开共产党和工人党代表会议，苏共代表团和中共代表团发生激烈争论。会后，苏联撤走在华的全部专家，撕毁几百个协定和合同，停止供应重要设备。当时，以美国为首的西方国家一直对华经济封锁。苏联的严重措施，实际上断绝了中国从国外获取先进技术装备的正常渠道。与此同时，中国正处在三年困难时期，正经历着前所未有的严峻考验。在严重困难面前，毛泽东始终保持着中华民族大无畏的气概顶住了大国沙文主义的压カ。中国人民独立自主、自力更生的精神、赢得了普遍的赞誉。1961年12月，毛泽东在广州，为即将召开的中共中央扩大的工作会议做准备。他读了陆游的《卜算子·咏梅》，感到文辞好；但意志消沉，只可借其形，不可用其义，于是他再续一首与陆游的词风格不同的咏梅词，目的主要是鼓励大家蔑视困难，敢于战胜困难。此词最早发表于1963年12月人民文学出版社出版的《毛主席诗词》。"
    },
{
        year: "1963年",
        title: "满江红·和郭沫若同志",
        content: "小小寰球，有几个苍蝇碰壁。嗡嗡叫，几声凄厉，几声抽泣。蚂蚁缘槐夸大国，蚍蜉撼树谈何易。正西风落叶下长安，飞鸣镝。多少事，从来急；天地转，光阴迫。一万年太久，只争朝夕。四海翻腾云水怒，五洲震荡风雷激。要扫除一切害人虫，全无敌。",
        analysis: "满江红·和郭沫若同志是毛泽东在1963年创作的一首词，它表达了作者对于当时国际形势的看法以及对于中国人民的鼓励。这首词的语言刚劲有力，气势磅礴，充满了战斗精神。 词的上片，作者以“小小寰球，有几个苍蝇碰壁”来形容当时的国际形势，寓意深刻，形象生动。接着，“蚂蚁缘槐夸大国，蚍蜉撼树谈何易”这两句词，更是运用了生动的比喻，揭示了一些国家的虚伪和无知。 词的下片，“多少事，从来急；天地转，光阴迫”，表达了时间的紧迫性和任务的艰巨性。最后，“要扫除一切害人虫，全无敌”，则是对中国人民的鼓励，表达了作者对于中国人民能够战胜一切困难的坚定信念。 总的来说，满江红·和郭沫若同志这首词，语言精炼而富有力量，寓意深远，充分展现了毛泽东作为一位伟大领袖的豪情壮志和对人民的深深关怀。",
        audio: './scr/audio/满江红·和郭沫若同志.mp3',
        bg: "《满江红·和郭沫若同志》是毛泽东于1963年创作的一首词。是在《光明日报》上读到郭沫若的词深受感动所创作的一首鼓舞人心的反霸权主义的词。"
    },
{
        year: "1965年",
        title: "水调歌头·重上井冈山",
        content: "久有凌云志，重上井冈山。千里来寻故地，旧貌变新颜。到处莺歌燕舞，更有潺潺流水，高路入云端。过了黄洋界，险处不须看。风雷动，旌旗奋，是人寰。三十八年过去，弹指一挥间。可上九天揽月，可下五洋捉鳖，谈笑凯歌还。世上无难事，只要肯登攀。",
        analysis: "长久以来都抱有宏大的志向，今天我再次登上井冈山。从千里之外来寻访这片旧地，哪里还有半分它昔日的容颜。到处都是莺啼燕飞的晚春新景，流水潺潺，宽大的盘山公路直入云端。过了黄洋界隘口，就没有任何的险处可看了。当年革命时期风雷激荡，红旗漫卷，这就是人世间。三十八年都过去了，犹如弹指的一刹那。可以飞向长空摘月亮，也可以潜下深海捉鱼或鳖，谈笑间高奏凯歌还师。世上没有什么困难的事，只要肯下定决心去登攀。",
        audio: './scr/audio/水调歌头·重上井冈山.mp3',
        bg: "《水调歌头·重上井冈山》是毛泽东于1965年5月25日时隔38年重回井冈山而写的一首词，词中描绘了作者毛泽东重上井冈山后所看到的旧貌变新颜的生机勃勃的美好景色，回顾了井冈山的革命斗争历史，抒发了作者的无限感慨和欢欣之情，赞美了共产党人和革命人民所具有的藐视困难、敢于战胜困难的英雄气概和凌云壮志。"
    },
{
        year: "1996年",
        title: "七绝·贾谊",
        content: "贾生才调世无伦，哭泣情怀吊屈文。梁王堕马寻常事，何用哀伤付一生。",
        analysis: "这首诗的首句赞美了贾谊的杰出才华，世无伦表明他的才华无人可比。第二句则描述了贾谊的悲哀情绪，他在极度悲伤的情况下写下了吊念屈原的文章。第三句和第四句则是对贾谊的死亡进行了反思，认为梁王的死亡是一件平常的事，贾谊没有必要因此而感到如此悲伤，甚至付出自己的生命。 这首诗的主题是对贾谊一生的回顾和评价，通过对其才华的赞美和对其悲剧结局的反思，表达了诗人对贾谊深深的惋惜和同情。同时，这也是一首具有深刻社会意义的诗，它揭示了封建社会的残酷和不公，以及人才被埋没的社会现实。",
        audio: './scr/audio/七绝·贾谊.mp3',
        bg: "《七绝·贾谊》是毛泽东写的一首七言绝句。整首诗反映了作者对贾谊“世无伦”的才华十分赞赏，对其怀才不遇、仕途受挫、未获重用、早亡，非常惋惜；同时对贾谊那种自伤、脆弱、愚忠、迂腐的性格作了委婉的批评。语言明白流畅，化用前人诗句，洒脱自如，韵味深长"
    },
];


// 生成诗词和赏析的HTML内容
const poemsContainer = document.getElementById("poemsContainer");
poems.forEach((poem, index) => {
    // 将诗词内容按空格分割
    const poemContent = poem.content.split(" ").filter(word => word.trim() !== "");
    
   // 生成每个单词的 HTML，并每隔一个单词添加一个段落
    let poemContentHtml = "";
    poemContent.forEach(word => {
       poemContentHtml += `<p>${word}</p>`;
    });

    const poemAnalysis = poem.analysis.split(" ").filter(word => word.trim() !== "");
    
    // 生成每个单词的 HTML，并每隔一个单词添加一个段落
     let poemAnalysisHtml = "";
     poemAnalysis.forEach((word, index) => {
        poemAnalysisHtml += `<p>${word}</p>`;
        if (index % 2 === 1) {
            poemAnalysisHtml += "<br>";
        }
    });

    const poemHtml = `
        <div class="container ${index % 2 === 0 ? 'left' : 'right'}">
            <h2>${poem.year}</h2>
            <div class="poem poem-${index}">
                <h3>${poem.title}</h3>
                <p>${poemContentHtml}</p>
                <div class="button-container">
                    <button class="play-button" onclick="playAudio('audio${index}')">播放朗诵</button>
                    <audio id="audio${index}" src="${poem.audio}"></audio>
                    <button class="pause-button" onclick="pauseAudio('audio${index}')">暂停播放</button>
                </div>
            </div>

            <button class="btn" onclick="showPoemAnalysis('bg${index}')">创作背景</button>
            <button class="btn" onclick="showPoemAnalysis('analysis${index}')">查看赏析</button>
          
        </div>
        <div id="analysis${index}" class="modal">
            <div class="modal-content">
                <span class="close" onclick="closeModal('analysis${index}')">&times;</span>
                <h2>${poem.title}赏析</h2>
                <p>${poem.analysis}</p>
            </div>
        </div>
        <div id="bg${index}" class="modal">
            <div class="modal-content">
                <span class="close" onclick="closeModal('bg${index}')">&times;</span>
                <h2>创作背景</h2>
                <p>${poem.bg}</p>
            </div>
        </div>
    `;
    poemsContainer.innerHTML += poemHtml;
});

//搜索
function performSearch() {
    const query = document.getElementById('search-input').value.trim().toLowerCase();
    if (query) {
        const poetryElement = document.getElementById('poetry');
        const poemElements = poetryElement.querySelectorAll('div');
        let found = false;

        poemElements.forEach(poemElement => {
            if (poemElement.textContent.toLowerCase().includes(query)) {
                found = true;
                poemElement.scrollIntoView({ behavior: 'smooth' });
                poemElement.classList.add('highlight');
                setTimeout(() => {
                    poemElement.classList.remove('highlight');
                }, 2000);
            }
        });

        if (!found) {
            alert('未找到匹配的诗词');
        }
    }
}
